# your code goes here
# -*- coding=utf-8 -*-
import random
 
who = ["заяц", "Путин", "Чебурашка", "раввин", "админ АКБ", "зять", "бомж", "Супермен", \
"футболист", "зек"]
comes = ["в бассейн", "в банк", "к врачу", "в детдом", "на похороны", "к грузину", \
"на свадьбу", "в деканат", "в церковь", "в ад"]
says = ["Сколько с меня?", "Ой-ой, течёт!", "Плюньте мне на грудь", "Мама, это я", \
"Я ж охранник как-никак", "БЮУУУ", "Стааасечка", "Мама делала не так", "Я уголь привёз", "Я веган"]
other = ["Лысый ёжик на это", "Сердобол отвечает", "Табличка гласит", "С неба голос", \
"Болельщики ему", "Гобзавр, смеясь", "Ведущий по телеку", "Священники хором", "Управдом ему", "Мама, рыдая"]
answers = ["У вас уши из трубки торчат", "Это дело паправимоэ", "Боря, ты что, кончил?!", \
"Ещё 9 палок колбасы!", "Давай, оближу!", "Петрович, ты заебал!", "Колян!", \
"Так ничего удивительного", "Ну не во время минета же!", "Тогда соси"]
final = ["И улетели оба!", "Ему пришлось", "Безобразие", "Люблю монахинь", \
"А альтернатива — утки", "Теперь так каждый день", "Просто праздник какой-то", \
"И тишина", "Даже ложка стоит", "По косячку?"]
 
who_x = who[random.randint(0, 9)]
comes_x = comes[random.randint(0, 9)]
says_x = says[random.randint(0, 9)]
other_x = other[random.randint(0, 9)]
answers_x = answers[random.randint(0, 9)]
final_x = final[random.randint(0, 9)]
print "Приходит " + who_x + " " + comes_x + ": \"" + says_x + "\". " + \
other_x + ": \"" + answers_x + "\". " + \
final_x + (" " if (final_x[-1] == "!" or final_x[-1] == "?") else ". ")